In [1]:
import pandas as pd
import numpy as np

In [2]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_label = ['Raju','Pandey','Srini','Sunil','Ashok']
Column_label = ['Age','Height','Weight']

In [4]:
df = pd.DataFrame(data = matrix_data,index=row_label,columns=Column_label)
df

        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [6]:
print('Type of column:',type(df['Height']))

df['Height']

Type of column: <class 'pandas.core.series.Series'>

Raju      66
Pandey    70
Srini     62
Sunil     68
Ashok     62
Name: Height, dtype: int32

In [7]:
print('Type of column:',type(df[['Height','Weight']]))

df[['Height','Weight']]

Type of column: <class 'pandas.core.frame.DataFrame'>

        Height  Weight
Raju        66     140
Pandey      70     148
Srini       62     125
Sunil       68     160
Ashok       62     152

In [8]:
df.Age

Raju      22
Pandey    42
Srini     30
Sunil     35
Ashok     25
Name: Age, dtype: int32

In [9]:
#Slicing Particular Element

#Using Loc

df.loc['Raju']

Age        22
Height     66
Weight    140
Name: Raju, dtype: int32

In [10]:
#Using Iloc

df.iloc[0]

Age        22
Height     66
Weight    140
Name: Raju, dtype: int32

In [11]:
df

        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [12]:
df.loc['Pandey','Height']

70

In [13]:
df.loc['Ashok',['Height','Weight']]

Height     62
Weight    152
Name: Ashok, dtype: int32

In [14]:
df.loc[['Srini','Sunil'],['Height','Weight']]

       Height  Weight
Srini      62     125
Sunil      68     160

In [15]:
#Data on Condition

df.loc[['Srini','Sunil']]

       Age  Height  Weight
Srini   30      62     125
Sunil   35      68     160

In [16]:
df

        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [17]:
#Data on Condition

x = df['Height']>65
df[x]

        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Sunil    35      68     160

In [18]:
a = df['Height']>65
b= df['Weight']>145
df[a & b]

        Age  Height  Weight
Pandey   42      70     148
Sunil    35      68     160

In [19]:
df[a][['Height','Weight']]

        Height  Weight
Raju        66     140
Pandey      70     148
Sunil       68     160

In [20]:
df

        Age  Height  Weight
Raju     22      66     140
Pandey   42      70     148
Srini    30      62     125
Sunil    35      68     160
Ashok    25      62     152

In [21]:
#Resetting Index
print('After resetting index:\n')
df.reset_index()

After resetting index:

    index  Age  Height  Weight
0    Raju   22      66     140
1  Pandey   42      70     148
2   Srini   30      62     125
3   Sunil   35      68     160
4   Ashok   25      62     152

In [29]:
c = df['Age'] < 35
df = df[c]
df

       Age  Height  Weight
Raju    22      66     140
Srini   30      62     125
Ashok   25      62     152

In [30]:
print(df.reset_index(drop=True))

   Age  Height  Weight
0   22      66     140
1   30      62     125
2   25      62     152

In [31]:
#Adding new column

df['Profession'] = 'Student Teacher Engineer'.split()
df

       Age  Height  Weight Profession
Raju    22      66     140    Student
Srini   30      62     125    Teacher
Ashok   25      62     152   Engineer

In [32]:
#setting profession as column

print(df.set_index('Profession'))

            Age  Height  Weight
Profession
Student      22      66     140
Teacher      30      62     125
Engineer     25      62     152